welcome = (
        "<b>Привет! Это daten — место, где общение начинается с симпатии.</b> 🔥\n\n"
        "Здесь всё просто:\n"
        "1. Заполни анкету\n"
        "2. Ставь лайки\n"
        "3. Общайся при взаимности\n\n"
        "Нажми на кнопку ниже, чтобы начать! 👇"
    )

enter_name = (
    "Отлично! Приступим к заполнению анкеты.\n"
    "<b>Введите свое имя</b>"
)

enter_birthday = (
    "<b>Введите свою дату рождения</b>\n"
    "Формат ввода <b>дд.мм.гггг</b>"
)

incorrect_date_format = (
    "<b>Некоректный формат!</b>\n"
    "Пожалуйста, введите дату в <b>формате дд.мм.гггг</b>"
)

enter_max_age = (
    "<b>Укажите максимальный возраст партнера</b>\n"
    "Введите число (например, 35)"
)

enter_min_age = (
    "<b>Укажите минимальный возраст партнера</b>\n"
    "Введите число (например, 18)"
)

select_gender = (
    "<b>Выберите свой пол</b>\n"
    "Воспользуйтесь кнопками ниже"
)

incorrect_gender = (
    "<b>Некоректный формат!</b>\n"
    "Пожалуйста, выберете пол из предложенных вариантов"
)

select_search_gender = (
    "<b>Кто вас интересует?</b>\n"
    "Выберите пол партнера, которого мы будем искать"
)

enter_location = (
    "<b>Поделитесь своей геолокацией</b>\n"
    "Это поможет найти людей неподалеку. Отправьте локацию через меню вложений"
)

enter_bio = (
    "<b>Расскажите о себе</b>\n"
    "Напишите краткую информацию, которую увидят другие пользователи (до 500 символов)"
)

enter_search_radius = (
    "<b>Укажите радиус поиска (в км)</b>\n"
    "На каком максимальном расстоянии искать людей?"
)

enter_photo_link = (
    "<b>Загрузите свое фото</b>\n"
    "Отправьте фотографию, чтобы сделать анкету привлекательнее"
)

long_message_error = (
    "<b>Слишком длинное сообщение!</b>"
)